package main

import "fmt"

// Реализовать бинарный поиск встроенными методами языка.

func binarySearch(a []int, target int) (int, bool) {
	left, right := 0, len(a)-1

	for left <= right {
		mid := (left + right) / 2

		//цикл будет продолжаться до тех пор пока mid не станет == target
		if a[mid] == target {
			return mid, true
			//от случая будем сдвигать влево или вправо
		} else if a[mid] < target {
			left = mid + 1
		} else {
			right = mid - 1
		}
	}
	return -1, false
}

func main() {
	arr := []int{
		1, 3, 5, 7, 9, 11, 13, 15, 17, 19,
		21, 23, 25, 27, 29, 31, 33, 35, 37, 39,
		41, 43, 45, 47, 49, 51, 53, 55, 57, 59,
		61, 63, 65, 67, 69, 71, 73, 75, 77, 79,
		81, 83, 85, 87, 89, 91, 93, 95, 97, 99,
		101, 103, 105, 107, 109, 111, 113, 115, 117, 119,
		121, 123, 125, 127, 129, 131, 133, 135, 137, 139,
		141, 143, 145, 147, 149, 151, 153, 155, 157, 159,
		161, 163, 165, 167, 169, 171, 173, 175, 177, 179,
		181, 183, 185, 187, 189, 191, 193, 195, 197, 199,
	}
	target := 7

	fmt.Println(binarySearch(arr, target))
}
